import matplotlib.pyplot as plt
import numpy as np
# from statistics import variance


sensing_radius = [
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    2,
    3,
    3,
    3,
    3,
    3,
    3,
    3,
    3,
    3,
    3,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
    5,
]

media_riqueza = [
    44900.434196509974,
    43478.855995568396,
    42564.55701441619,
    36185.75899910332,
    42837.883623884445,
    52079.703478421245,
    48196.883658991064,
    53251.853007871585,
    43849.06514817217,
    44233.35600323965,
    38849.32226141865,
    42531.29763931233,
    40441.539150198754,
    46790.93921259982,
    52265.39068229249,
    45162.156097123814,
    32537.999659138903,
    42917.60117917136,
    44961.698062631665,
    41312.40406321593,
    53568.228964889,
    37975.15132319001,
    49206.23454486598,
    44461.7311477015,
    39323.20126643207,
    28921.38144493707,
    43926.696375367064,
    44178.86560252915,
    37410.62446096162,
    40023.07781928089,
    44679.6975926452,
    40747.420947103616,
    38155.20351980812,
    50952.178044619344,
    48440.55914954391,
    48776.44175688197,
    42259.00401468471,
    43798.66166580875,
    51669.62756928267,
    38670.14210535973,
    40818.301309730276,
    53900.19254681173,
    49127.26381939445,
    44879.83847983353,
    39977.41224284139,
    51484.11005395822,
    46615.46466613475,
    45467.99281126786,
    43404.64246643604,
    42358.75833129114,
]


if __name__ == "__main__":
    # Calcular o desvio padrão
    desvio_padrao = np.std(media_riqueza)
    # variance(sensing_radius)

    plt.figure(figsize=(10, 6))
    plt.scatter(
        sensing_radius, media_riqueza, color="blue", label="Riqueza média do investidor"
    )
    plt.errorbar(
        sensing_radius,
        media_riqueza,
        yerr=desvio_padrao,
        fmt="o",
        color="red",
        label="Desvio Padrão",
    )
    plt.xlabel("Raio de sensoriamento")
    plt.ylabel("Riqueza média")
    plt.title("Riqueza média do investidor em função do raio de sensoriamento")
    plt.grid(True)
    plt.legend()
    plt.show()
